In [33]:
# List of High Schools
high_schools = ["Hernandez High School", "Figueroa High School", "Wilson High School", "Wright High School"]
for i in high_schools:
    print(i)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [34]:
high_school_types = [{"High School":"Griffin", "Type":"District"},
                     {"High School":"Figueroa", "Type":"District"},
                    {"High School":"Wilson", "Type":"District"},
                    {"High School":"Wright","Type":"District"}]
for entries in high_school_types:
    print(entries)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'District'}
{'High School': 'Wright', 'Type': 'District'}

In [35]:
# A Dictionary of high schools and the type of school
high_school_types = [{"High School":"Griffin", "Type":"District"},
                     {"High School":"Figueroa", "Type":"District"},
                    {"High School":"Wilson", "Type":"District"},
                    {"High School":"Wright","Type":"District"}]
#entries2 = {}
for entries in high_school_types:
    #entries2 = entries
    for keys, value in entries.items():
        print(keys, value)
        #print(value)

High School Griffin
Type District
High School Figueroa
Type District
High School Wilson
Type District
High School Wright
Type District

In [36]:
high_school_types = [{"High School":"Griffin", "Type":"District"},
                     {"High School":"Figueroa", "Type":"District"},
                    {"High School":"Wilson", "Type":"District"},
                    {"High School":"Wright","Type":"District"}]
for entries in high_school_types:
    #Borrowed Code from https://bobbyhadz.com/blog/python-print-dictionary-without-brackets
    result = ', '.join(f'"{key}":"{value}"' for key, value in entries.items())
    print(result)

"High School":"Griffin", "Type":"District"
"High School":"Figueroa", "Type":"District"
"High School":"Wilson", "Type":"District"
"High School":"Wright", "Type":"District"

In [37]:
# List of high schools into panda series
high_schools = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School",
                "Griffin High School","Wilson High School", "Cabrera High School","Bailey High School", 
                "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", 
                "Johnson High School", "Ford High School", "Thomas High School"]
import pandas as pd #dependency name is pd so when we want to call on Pandas we can just type pd

school_series = pd.Series(high_schools)
for i in school_series:
    print(i)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [47]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]
import pandas as pd
school_df = pd.DataFrame(high_school_dicts)
school_df.iloc[[0,2,4],-2:-1]
#school_df.loc[:,"school_name":"type"]

           school_name
0    Huang High School
2  Shelton High School
4  Griffin High School

In [ ]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [ ]:
import pandas as pd
#initialize a dataframe
schools_df = pd.DataFrame()

In [ ]:
schools_df["School ID"] = school_id

schools_df

In [ ]:
schools_df["school_name"] = school_name

schools_df["type"] = type_of_school

schools_df

In [ ]:
# Create a dictionary of information on high schools.
# This is a dictionary of Lists which essentially already turns python data types into a data frame since
# key1 becomes our header1 with the associated list the data in the column, then key2 is header2...
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

schools2_df = pd.DataFrame(high_schools_dict)
schools2_df

In [ ]:
schools2_df.columns

In [ ]:
schools2_df.index

In [ ]:
schools2_df.values

In [ ]:
school_id = [0, 1, 2, 3, 4,5,6,7,8,9,10,11,12,13,14]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School", "Wilson High School", "Cabrera High School",
              "Bailey High School", "Holden High School", "Pena High School", "Wright High School",
              "Rodriguez High School", "Johnson High School","Ford High School", "Thomas High School"]

type_of_school = ["District", "District", "Charter", "District","Charter", "Charter", "Charter","District", 
                  "Charter", "Charter", "Charter", "District", "District", "District", "Charter"]

import pandas as pd
import numpy as np

schools3_df = pd.DataFrame()

schools3_df["School ID"] = school_id
schools3_df["school_name"] = school_name
schools3_df["type"] = type_of_school

schools3_df

In [1]:
import pandas as pd

prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})

prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [2]:
prices.dtypes

price_usd    object
dtype: object

In [3]:
#prices.loc[:,"price_usd"] = prices.loc[:,"price_usd"].str.replace("$", "")
seriestest = pd.Series(prices.price_usd)
seriestest = seriestest.str.replace('$','', regex='FALSE')
#seriestest
prices.price_usd = seriestest
prices
prices.dtypes
#prices
#prices.dtypes
#print(prices)

price_usd    object
dtype: object

In [4]:
type(seriestest)

pandas.core.series.Series

In [5]:
type(prices.loc[:,'price_usd'])

pandas.core.series.Series

In [6]:
type(prices.price_usd)

pandas.core.series.Series

In [7]:
prices['price_usd'] = prices['price_usd'].astype('float')
prices.dtypes
#prices

price_usd    float64
dtype: object

In [1]:
import pandas as pd
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [7]:
testing = sales_df.sum()
type(testing)

pandas.core.series.Series

In [4]:
goog_df = pd.DataFrame({"AAPL": [1045.85, 1070.08, 1140.99, 1113.65, 1193.32, 1231.54, 1215.00, 1207.15,1248.84, 1166.27, 1138.85, 1003.63, 1080.91]})

goog_df.describe()

              AAPL
count    13.000000
mean   1142.775385
std      76.556568
min    1003.630000
25%    1080.910000
50%    1140.990000
75%    1207.150000
max    1248.840000

In [8]:
type(goog_df.sum())

pandas.core.series.Series

In [10]:
testing2 = goog_df.sum()

In [11]:
type(testing2)

pandas.core.series.Series

In [6]:
import pandas as pd
# Create a DataFrame
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1], "testing":[1,2,3,4,5]})

# Select the first row using iloc
aapl_returns.iloc[:,0]

0    0.50
1    0.56
2    0.59
3    0.52
4    0.10
Name: AAPL, dtype: float64

In [9]:
#similar to the above code using python list instead of series/dataframe
aapl_returns2 = [0.5, 0.56, 0.59, 0.52, 0.1]
first_item = aapl_returns2[0:3]
first_item

[0.5, 0.56, 0.59]

In [18]:
import pandas as pd
#why does this only return the 3rd to last and 2nd to last values?  But just -1 returns the last one
aapl_returns3 = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1, 0.75, 0.47]})
aapl_returns3.iloc[-3:-1]

   AAPL
4  0.10
5  0.75

In [20]:
import numpy as np
#builds a dataframe with dates as the index and random quantities for column Revenue
revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000),
    index=pd.date_range('1/1/2017', periods=1000),
    columns=["revenue"])
#revenue_df.tail()
revenue_df.loc['2018-10-01':'2019-03-31'].describe()

          revenue
count  182.000000
mean   471.115385
std    271.568745
min      2.000000
25%    241.500000
50%    451.500000
75%    676.500000
max    989.000000

In [25]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
#sales_df.head()
sales_df.loc[sales_df["quantity"] > 10]

       item  quantity  total_price
0  tomatoes        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

In [52]:
#sales_df.loc[(sales_df["quantity"] > 10) | (sales_df["total_price"] < 45)]
sales_df

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [31]:
#filter with max
max_price_row = sales_df.loc[sales_df["total_price"] == sales_df["total_price"].median()]
max_price_row

       item  quantity  total_price
3  tomatoes        12         40.2

In [28]:
type(max_price_row)

pandas.core.frame.DataFrame

In [32]:
sales_df.loc[sales_df["item"] == "tomatoes", ["total_price"]].mean()

total_price    45.225
dtype: float64

In [53]:
#sales_df.sort_values(["item"])
sales_df.sort_values(["item","quantity"],ascending = False)

        item  quantity  total_price
0   tomatoes        15        50.25
3   tomatoes        12        40.20
2   potatoes        10        50.01
1     onions        26        39.52
4  mushrooms         2         8.46